# Задача 2: Найдите сумму цифр трехзначного числа.
# Примеры:
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

n = int(input("Введите первое число:  "))
n1 = int(input("Введите второе число:  "))
n2 = int(input("Введите третье число:  "))

print(n + n1 + n2)